questions = [
    {
    "q":"2+2=?",
    "a1":"2",
    "a2":"3",
    "a3":"4",
    "a4":"5",
    'correct':"c",
    'prize':"100"
    },
    {
    "q":"2+3=?",
    "a1":"2",
    "a2":"3",
    "a3":"4",
    "a4":"5",
    'correct':"d",
    'prize':"200"
    },
    {
    "q": "10+10=?",
    "a1": "10",
    "a2": "100",
    "a3": "20",
    "a4": "200",
    'correct': "c",
    'prize': "300"
    },
    {
    "q": "30+20=?",
    "a1": "40",
    "a2": "50",
    "a3": "60",
    "a4": "70",
    'correct': "b",
    'prize': "500"
    },
    {
    "q":"20*3=?",
    "a1":"100",
    "a2":"600",
    "a3":"60",
    "a4":"30",
    'correct':"c",
    'prize':"1000"
    },
    {
    "q":"30/3=?",
    "a1":"10",
    "a2":"20",
    "a3":"6",
    "a4":"5",
    'correct':"a",
    'prize':"2000"
    },
    {
    "q": "25*5=?",
    "a1": "200",
    "a2": "125",
    "a3": "75",
    "a4": "95",
    'correct': "b",
    'prize': "10000"
    },
    {
    "q": "120+120=?",
    "a1": "250",
    "a2": "260",
    "a3": "220",
    "a4": "240",
    'correct': "d",
    'prize': "100000"
    },
    {
    "q": "123*3=?",
    "a1": "345",
    "a2": "456",
    "a3": "369",
    "a4": "360",
    'correct': "c",
    'prize': "500000"
    },
    {
    "q": "468/2=?",
    "a1": "146",
    "a2": "234",
    "a3": "400",
    "a4": "243",
    'correct': "b",
    'prize': "1000000"
    }
]
def igra(q):                                                           #функция вывода вопроса, проверки ответа и определение выйгрыша
    trig = 0                                                                #переменная чтобы проверить правильность ввода ответа
    print(f'Ответь на вопрос №:{q+1}, {questions[q].get("q")}')
    print(f'Варианты ответа :\na - {questions[q].get("a1")}    b - {questions[q].get("a2")}\nc - {questions[q].get("a3")}    d - {questions[q].get("a4")}')
    while trig != 1:                                                         #выполняем цикл пока не наступит реторн
        in_ans = input(f'введи букву ответа: ')
        if in_ans == 'a' or in_ans == 'b' or in_ans == 'c' or in_ans == 'd': #проверим введенные абсд
            if in_ans == questions[q].get("correct"):                        #сравним введеную букву с правильной буквой
                print(f'Позравляю ответ верный. Твой выйгрыш {questions[q].get("prize")}')
                return questions[q].get("prize")                           #переменная вернет номер вопроса и размер выйгрыша
            else:
                print('Ответ не верный')                                     #переменная вернет номер вопроса и размер выйгрыша
                return 0
        else:
            print('такого варианта нет, пробуй еще')
print('Отвечай на вопросы зарабатывай деньги')
for q in range(10):                                                      #перебираем вопросы
    print(f'*************************\nВопрос №{q+1} стоимостью {questions[q].get("prize")}')
    prize = igra(q)                                                     #выполняю функцию и записываю ответ в переменную
    if prize == 0:
        print('Ты проиграл, игра закончена')
        exit()                                                          #если выйгрыш равен 0 заканчиваю выполнение
print(f'Ты достиг максимальнго выйгрыша {prize}')                      #если дошел до конца цикла ты прошел всю игру







# print(igra(2,3))




# print(questions[1].get('q'))
